Documents/абс_СтратегическиеЦелиПродаж/абс_СтратегическиеЦелиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СтратегическиеЦелиПродаж</name>
  <registerRecords>InformationRegister.абс_СтратегическиеЦелиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.абс_ЦелиПродаж</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПлана</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТочекПродаж</name>
      <comment>Общее количество точек продаж</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АКБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоАртикулов</name>
      <comment>Среднее количество артикулов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Канал</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоЧисленнойДистрибуции</name>
      <comment>Общее количество точек в которых есть хотя бы одна позиция марки Леовит</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА1</name>
      <comment>Количество точек содержащих фокусный ассортимент 1 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА2</name>
      <comment>Количество точек содержащих фокусный ассортимент 2 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА3</name>
      <comment>Количество точек содержащих фокусный ассортимент 3 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА4</name>
      <comment>Количество точек содержащих фокусный ассортимент 4 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Documents/абс_СтратегическиеЦелиПродаж/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПериодПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Элемент.Родитель.ТекущиеДанные.Период, Перечисления.Периодичность.Месяц);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзEXCEL(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Сначала запишите документ!");
		Возврат;
	КонецЕсли; 
	СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
	ФормаЗагрузки = ПолучитьФорму("Документ.абс_СтратегическиеЦелиПродаж.Форма.ФормаЗагрузки", СтруктураПараметров, Объект.Ссылка);
	ФормаЗагрузки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "абс_СтратегическиеЦелиПродаж_ЗагрузкаИзEXCEL" Тогда
		Если Объект.СоставПлана.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Заменить данные в документе?";
			Ответ = Вопрос(Текст, Режим, 0);    
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.СоставПлана.Очистить();			
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьТЧДокументаПоТаблицеСервер(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Попытка
		ЭтотОбъект.ЗаполнитьТЧДокументаПоТаблице(ЭтотОбъект, ТабДок);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Некорректный формат таблицы загрузки: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	абс_СогласованиеДокументов.УстановитьДоступностьРедактирования(Объект.Ссылка,ЭтаФорма);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_СтратегическиеЦелиПродаж")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
	
	Если Объект.СоставПлана.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Заменить данные в документе?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СоставПлана.Очистить();			
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийФайл 	= Новый ДвоичныеДанные(ПутьКФайлу);
	
	АдресФайлаВХранилище = "";
	
	Если ПоместитьВоВременноеХранилище(ВнешнийФайл, АдресФайлаВХранилище) Тогда
	
		ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище);
		
	Иначе
		
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер!");
		
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище)
	
	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel(АдресФайлаВХранилище);
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_СтратегическиеЦелиПродаж")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СоставПланаТерриторияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставПлана.ТекущиеДанные;
	ТекущаяСтрока.Регион =  ПолучитьБизнесРегионПоУровню(ТекущаяСтрока.Территория, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаГородПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставПлана.ТекущиеДанные;
	ТекущаяСтрока.Территория = ПолучитьБизнесРегионПоУровню(ТекущаяСтрока.Город, 1);
	ТекущаяСтрока.Регион = ПолучитьБизнесРегионПоУровню(ТекущаяСтрока.Город, 0);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБизнесРегионПоУровню(ТекущийРегион, Уровень)
	
	Если ТекущийРегион.Пустая() Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	ТекущийУровень = ТекущийРегион.Уровень();
	Если ТекущийУровень<Уровень Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	БизнесРегион = ТекущийРегион;
	Сч = ТекущийУровень - Уровень;
	Пока Сч>0 Цикл
		БизнесРегион = БизнесРегион.Родитель;
		Сч = Сч - 1;
	КонецЦикла;
	
	Возврат БизнесРегион;
	
КонецФункции
